#+TITLE: Things That I Have Done
#+AUTHOR: Yajun Fu
#+EMAIL: fuyajun1983cn AT 163 DOT com
#+STARTUP:overview
#+STARTUP: hidestars
#+OPTIONS: toc:t

**** DONE [#A] 802.11(1999) chapter 6-7                                :STUDY:
    CLOSED: [2015-11-30 周一 16:45] DEADLINE: <2015-11-30 周一> SCHEDULED: <2015-11-27 周五>
   CLOCK: [2015-11-30 周一 13:24]--[2015-11-30 周一 16:46] =>  3:22
MAC service and frame format
Added: [2015-11-26 周四 16:50]
**** DONE [#A] 802.11(1999) chapter 8[0.5d]                            :STUDY:
    CLOSED: [2015-12-01 周二 18:35] DEADLINE: <2015-12-01 周二> SCHEDULED: <2015-12-01 周二>
   CLOCK: [2015-12-01 周二 13:27]--[2015-12-01 周二 13:55] =>  0:28
   CLOCK: [2015-12-01 周二 11:07]--[2015-12-01 周二 12:03] =>  0:56
802.11 authentication + WEP
Added: [2015-11-26 周四 16:50]
*** DONE CWNA第九章学习                                                :STUDY:
    CLOSED: [2015-12-08 周二 14:40]
    CLOCK: [2015-12-02 周三 10:05]--[2015-12-02 周三 11:46] =>  1:41
    CLOCK: [2015-12-01 周二 16:53]--[2015-12-01 周二 18:32] =>  1:39
    CLOCK: [2015-12-01 周二 15:00]--[2015-12-01 周二 15:32] =>  0:32
       MAC Architecture
       Added: [2015-12-01 周二 14:00]
*** DONE CWNA第八章                                                    :STUDY:
   CLOSED: [2015-11-30 周一 20:30]
   CLOCK: [2015-11-30 周一 17:01]--[2015-11-30 周一 20:29] =>  3:28
802.11 Medium Access
Added: [2015-11-27 周五 16:50]
*** DONE 第十三章                                                      :STUDY:
    CLOSED: [2015-12-10 周四 18:50]
    CLOCK: [2015-12-10 周四 14:30]--[2015-12-10 周四 18:51] =>  4:21
    CLOCK: [2015-12-10 周四 10:24]--[2015-12-10 周四 10:54] =>  0:30
    802.11 Network
    Security Arch itecture
    Added: [2015-12-01 周二 18:25]
*** DONE 第十八章                                                      :STUDY:
    CLOSED: [2015-12-14 周一 16:25]
    CLOCK: [2015-12-11 周五 13:56]--[2016-08-02 二 16:24] => 5642:28
    CLOCK: [2015-12-11 周五 09:57]--[2015-12-11 周五 11:00] =>  1:03
    802.11n
    Added: [2015-12-01 周二 18:30]
*** DONE Chapter 01 An Introduction to Device Drivers
    CLOSED: [2015-12-15 周二 11:05] DEADLINE: <2015-12-15 周二>
    CLOCK: [2015-12-15 周二 10:14]--[2015-12-15 周二 11:06] =>  0:52
*** DONE Chapter 02 Building and Running Modules
    CLOSED: [2015-12-15 周二 11:45] DEADLINE: <2015-12-15 周二>
    CLOCK: [2015-12-15 周二 11:14]--[2015-12-15 周二 11:47] =>  0:33
*** ✔ DONE DONE 无压的工作艺术第六章                           :无压工作的艺术:Study:
    CLOSED: [2016-05-18 周三 16:25]
    CLOCK: [2016-03-25 周五 09:15]--[2016-03-25 周五 09:42] =>  0:27

*** ✔ DONE DONE 阅读”无压工作的艺术“第九章                     :STUDY:无压工作的艺术:
    CLOSED: [2016-05-18 周三 16:25]
    - CLOSING NOTE [2016-03-29 周二 10:10] \\
      重视工作清单的作用,并严格执行。
    CLOCK: [2016-03-29 周二 09:43]--[2016-03-29 周二 10:12] =>  0:29
    1. 我们都可能遇到这种情况：有时，思维敏捷；有时，应该远离思考。
    2. 即使你并非处于最佳状态中，也没有理由变得松懈、低效。
    3. 除非你对工作了如指掌，否则，你不可能对抉择感到胸有成竹。
    4. 三种活动
       1. 处理预先明确的工作
       2. 处理随时出现的新工作
       3. 安排下一步的工作。
    5. 通常，你更容易被卷入到随时冒出来的紧急情况之中，而不是按部就班地
       去处理你的工作篮、电子邮件和其他悬而未决的问题。
    6. 工作中的6个层次
       1. 5万英尺以上：生活
       2. 4万英尺：3~5年的计划
       3. 3万英尺：1~2年的目标
       4. 2万英尺：责任范围
       5. 1万英尺：当前的工作
       6. 跑道：目前的行动
    7. 你的工作是发现你的工作，然后全身心地投入基中

**** DONE Part 2 - IEEE 802.11e Principles
     CLOSED: [2016-03-29 周二 15:30]
     - CLOSING NOTE [2016-03-29 周二 15:30] \\
       Access Categories:
       VI
       VO
       BE
       BK
     CLOCK: [2016-03-29 周二 15:25]--[2016-03-29 周二 15:28] =>  0:03
**** DONE Part 3 - User Priorities, Access Categories and Queues
     CLOSED: [2016-03-29 周二 15:35]
     - CLOSING NOTE [2016-03-29 周二 15:35] \\
       8 User Priorities
       4 Access Categories
       every physical station emulate 4 virtual station
     CLOCK: [2016-03-29 周二 15:29]--[2016-03-29 周二 15:34] =>  0:05
**** DONE Part 5 - Contention Window and Final Thoughts
     CLOSED: [2016-03-29 周二 16:05]
     - CLOSING NOTE [2016-03-29 周二 16:05] \\
       Contention Window vary on different AC
     CLOCK: [2016-03-29 周二 15:40]--[2016-03-29 周二 16:03] =>  0:23
*** ✔ DONE 实现一个jump命令，在不同工作目录之间跳转                :ME:我的开发需求:
     CLOSED: [2016-08-09 周二 17:15] SCHEDULED: <2016-08-09 周二>
    CLOCK: [2016-08-09 周二 16:25]--[2016-08-09 周二 17:13] =>  0:48
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** ✔ DONE TODO 研究Python属性                                         :Study:
    CLOSED: [2016-08-09 周二 17:45] SCHEDULED: <2016-08-09 周二>
    CLOCK: [2016-08-09 周二 17:16]--[2016-08-09 周二 17:43] =>  0:27
   :PROPERTIES:
   :Effort:   0:30
   :END:
      研究getattr, setattr
Added: [2016-08-09 周二 16:40]
*** ✔ DONE Roaming Function                            :Wifi Driver持续学习:Study:
     CLOSED: [2016-08-11 周四 09:45] SCHEDULED: <2016-08-11 周四>
     CLOCK: [2016-08-11 周四 09:15]--[2016-08-11 周四 09:44] =>  0:29
    - Next Action: 文档 E:\documents\wifi\学习资料\SOP\sta\MT76x2,
      MT7603 Linux WLAN Driver Study Materials\Roaming.ppx
*** ✔ DONE PMF(Protected Management Frame)             :Wifi Driver持续学习:Study:
     CLOSED: [2016-08-11 周四 09:50] SCHEDULED: <2016-08-11 周四>
     CLOCK: [2016-08-11 周四 09:48]--[2016-08-11 周四 09:51] =>  0:03
    - Next Action:
      PMF_intro_0915

*** ✔ DONE 整理正则表达式知识点                                        :Study:
    CLOSED: [2016-08-12 周五 09:25] SCHEDULED: <2016-08-12 周五>
    CLOCK: [2016-08-12 周五 09:12]--[2016-08-12 周五 09:22] =>  0:10
   :PROPERTIES:
   :Effort:   0:10
   :END:
整理正则表达式知识点到个人知识库
Added: [2016-08-12 周五 09:10]
*** ✔ DONE 整理plantuml语法参考笔记                                    :Study:
   CLOSED: [2016-08-13 六 14:55] SCHEDULED: <2016-08-13 周六>
    CLOCK: [2016-08-13 六 13:37]--[2016-08-13 六 14:56] =>  1:19
    CLOCK: [2016-08-11 周四 11:44]--[2016-08-11 周四 11:58] =>  0:14
    CLOCK: [2016-08-10 周三 19:08]--[2016-08-10 周三 19:53] =>  0:45
    CLOCK: [2016-08-09 周二 18:04]--[2016-08-09 周二 18:45] =>  0:41
   :PROPERTIES:
   :Effort:   3:00
   :END:
      整理PlantUML文档
Added: [2016-08-09 周二 18:00]

*** ✔ DONE [#A] demo 4k miracast                                     :Project:
    CLOSED: [2016-08-17 周三 16:00] SCHEDULED: <2016-08-16 周二>
    CLOCK: [2016-08-16 周二 15:38]--[2016-08-16 周二 17:16] =>  1:38
    分辨率，刷新帧率（支持60fps, 也要支持30fps）, 
Follow 4k Miracast Demo的事情
Added: [2016-08-10 周三 13:50]
*** ✔ DONE [#A] P2P Invitation的问题                                 :Project:
     CLOSED: [2016-08-18 周四 17:20] SCHEDULED: <2016-08-18 周四>
     CLOCK: [2016-08-18 周四 09:58]--[2016-08-18 周四 15:36] =>  5:38
     CLOCK: [2016-08-16 周二 13:38]--[2016-08-16 周二 15:32] =>  1:54
     CLOCK: [2016-08-15 周一 14:41]--[2016-08-15 周一 17:24] =>  2:43
     P2P Invitation失败的问题
     TODO:
     打开wpa_supplicant日志
     测试禁用persistent group的情况。update_config=0
     Set_WirelessMode_Proc失败的原因
     Added: [2016-08-10 周三 14:00]
*** ✔ DONE 修正 802.11n，p2p, 802.1x, wps等文档的输入及编排问题        :Study:
    CLOSED: [2016-08-22 周一 11:50] SCHEDULED: <2016-08-22 周一>
    CLOCK: [2016-08-22 周一 11:25]--[2016-08-22 周一 11:49] =>  0:24

Added: [2016-08-22 周一 10:05]
*** ✔ DONE 学习通信原理第一章[2/5]                                     :Study:
    CLOSED: [2016-08-24 周三 14:55] SCHEDULED: <2016-08-22 周一>
    CLOCK: [2016-08-24 周三 14:11]--[2016-08-24 周三 14:54] =>  0:43
    CLOCK: [2016-08-22 周一 13:37]--[2016-08-22 周一 14:24] =>  0:47
    - [X] 第1讲 电子通信的起源
    - [X] 第2讲  传输什么——消息
    - [ ] 第3讲  消息的通路——信道
    - [ ] 第4讲  无影无形的电波
    - [ ] 第5讲  两大武林门派
Added: [2016-08-22 周一 10:05]
*** ✔ DONE [#B] 复习CWNA内容                                           :Study:
     CLOSED: [2016-08-27 周六 16:35] DEADLINE: <2016-08-31 周三> SCHEDULED: <2016-08-25 周四>
     CLOCK: [2016-08-27 周六 15:44]--[2016-08-27 周六 16:35] =>  0:51
     CLOCK: [2016-08-27 周六 10:23]--[2016-08-27 周六 11:48] =>  1:25
     CLOCK: [2016-08-25 周四 09:29]--[2016-08-25 周四 10:27] =>  0:58
     CLOCK: [2016-08-24 周三 13:31]--[2016-08-24 周三 14:10] =>  0:39
     CLOCK: [2016-08-24 周三 09:41]--[2016-08-24 周三 10:14] =>  0:33
     CLOCK: [2016-08-23 周二 13:22]--[2016-08-23 周二 14:11] =>  0:49
     CLOCK: [2016-08-23 周二 11:00]--[2016-08-23 周二 11:59] =>  0:59
     CLOCK: [2016-08-22 周一 10:54]--[2016-08-22 周一 11:24] =>  0:30
     CLOCK: [2016-08-19 周五 14:11]--[2016-08-19 周五 14:34] =>  0:23
     CLOCK: [2016-08-19 周五 11:19]--[2016-08-19 周五 12:00] =>  0:41
     CLOCK: [2016-08-18 周四 16:11]--[2016-08-18 周四 17:05] =>  0:54
     CLOCK: [2016-08-17 周三 15:59]--[2016-08-17 周三 16:57] =>  0:58
     CLOCK: [2016-08-16 周二 09:35]--[2016-08-16 周二 10:16] =>  0:41
     CLOCK: [2016-08-15 周一 10:10]--[2016-08-15 周一 11:15] =>  1:05
     CLOCK: [2016-08-11 周四 09:53]--[2016-08-11 周四 11:29] =>  1:36
     CLOCK: [2016-08-09 周二 10:14]--[2016-08-09 周二 11:10] =>  0:56
    :PROPERTIES:
    :Effort:   8:00
    :END:
     - [X] 第一章
     - [X] 第二章
     - [X] 第三章
     - [X] 第五章
     - [X] 第六章
     - [X] 第七章
     - [X] 第八章
     - [X] 第九章
     - [X] 第十章
     - [X] 第十二章
     - [X] 第十三章
     - [X] 第十六章
     - [X] 第十八章
*** ✔ DONE [#A] Driver Genernal Intro
     CLOSED: [2016-08-30 周二 16:40] SCHEDULED: <2016-08-23 周二> DEADLINE: <2016-08-31 周三>
     CLOCK: [2016-08-30 周二 14:57]--[2016-08-30 周二 16:42] =>  1:45
     CLOCK: [2016-08-23 周二 14:33]--[2016-08-23 周二 17:08] =>  2:35
     - [X] Davinci Driver introduction
     - [X] Driver Init
     - [X] Glue Layer
     - [X] Davinci BssInfo_StaRec
     - [X] 7668 SW Proposal
     - [X] 7668 HW change
     
*** ✔ DONE [#A] hostpad学习                                            :Study:
     CLOSED: [2016-08-30 周二 17:45] DEADLINE: <2016-08-27 周六> SCHEDULED: <2016-08-24 周三>
     CLOCK: [2016-08-30 周二 16:59]--[2016-08-30 周二 17:41] =>  0:42
     CLOCK: [2016-08-22 周一 14:25]--[2016-08-22 周一 16:10] =>  1:45
     CLOCK: [2016-08-19 周五 14:36]--[2016-08-19 周五 16:33] =>  1:57
     CLOCK: [2016-08-17 周三 18:29]--[2016-08-17 周三 19:25] =>  0:56
     CLOCK: [2016-08-17 周三 17:11]--[2016-08-17 周三 18:12] =>  1:01
     CLOCK: [2016-08-16 周二 17:16]--[2016-08-16 周二 18:09] =>  0:53
     CLOCK: [2016-08-15 周一 13:20]--[2016-08-15 周一 14:34] =>  1:14
     CLOCK: [2016-08-15 周一 11:15]--[2016-08-15 周一 11:59] =>  0:44
     CLOCK: [2016-08-09 周二 13:56]--[2016-08-09 周二 15:51] =>  1:55
     CLOCK: [2016-08-09 周二 13:24]--[2016-08-09 周二 13:56] =>  0:32
    :PROPERTIES:
    :Effort:   8:00
    :END:
